; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v8 ?v9)
             (pred_10 ?v4 ?v10)
             (pred_5 ?v8 ?v10)
             (pred_8 ?v11 ?v8 )
	     (pred_12 ?v8)
             (pred_1 ?v5)
             (pred_3 ?v4)
             (pred_6 ?v10)
             (pred_7 ?v8)
             (pred_4 ?v4)
             (pred_2 ?v8)
             (pred_9 ))



(:action op_4
:parameters (?v7 ?v13 ?v6 ?v12)
:precondition (and (pred_1 ?v7) (pred_1 ?v13) (pred_3 ?v6) (pred_6 ?v12)
          (pred_11 ?v7 ?v13) (pred_10 ?v6 ?v12)
                   (pred_5 ?v13 ?v12) (pred_12 ?v7) 
                   (pred_7 ?v13) (pred_4 ?v6))
:effect (and  (pred_2 ?v13) (not (pred_7 ?v13))))


(:action op_5
:parameters (?v7 ?v2)
:precondition (and (pred_1 ?v7) (pred_1 ?v2)
               (pred_12 ?v7) (pred_11 ?v7 ?v2) (pred_2 ?v2))
:effect (and (pred_12 ?v2) (not (pred_12 ?v7))))

(:action op_3
:parameters (?v7 ?v6)
:precondition (and (pred_1 ?v7) (pred_3 ?v6) 
                  (pred_12 ?v7) (pred_8 ?v6 ?v7) (pred_9 ))
:effect (and (pred_4 ?v6)
   (not (pred_8 ?v6 ?v7)) (not (pred_9 ))))


(:action op_2
:parameters (?v7 ?v3 ?v1)
:precondition (and (pred_1 ?v7) (pred_3 ?v3) (pred_3 ?v1)
                  (pred_12 ?v7) (pred_4 ?v1) (pred_8 ?v3 ?v7))
:effect (and (pred_4 ?v3) (pred_8 ?v1 ?v7)
        (not (pred_4 ?v1)) (not (pred_8 ?v3 ?v7))))

(:action op_1
:parameters (?v7 ?v6)
:precondition (and (pred_1 ?v7) (pred_3 ?v6) 
                  (pred_12 ?v7) (pred_4 ?v6))
:effect (and (pred_9 ) (pred_8 ?v6 ?v7) (not (pred_4 ?v6)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_08 obj_20 obj_14 obj_01 obj_03 obj_06 obj_17 obj_05 obj_16 obj_13 obj_04 obj_15 obj_18 obj_02 obj_09
    obj_11 obj_12
    obj_10 obj_19
    )

    (:init
       (pred_9)

       (pred_1 obj_07)
       (pred_1 obj_08)
       (pred_1 obj_20)
       (pred_1 obj_14)
       (pred_1 obj_01)
       (pred_1 obj_03)
       (pred_1 obj_06)
       (pred_1 obj_17)
       (pred_1 obj_05)
       (pred_1 obj_16)
       (pred_1 obj_13)
       (pred_1 obj_04)
       (pred_1 obj_15)
       (pred_1 obj_18)
       (pred_1 obj_02)
       (pred_1 obj_09)
       (pred_6 obj_11)
       (pred_6 obj_12)
       (pred_3 obj_10)
       (pred_3 obj_19)

       (pred_11 obj_07 obj_01)
       (pred_11 obj_07 obj_08)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_08 obj_20)
       (pred_11 obj_08 obj_07)
       (pred_11 obj_20 obj_06)
       (pred_11 obj_20 obj_14)
       (pred_11 obj_20 obj_08)
       (pred_11 obj_14 obj_17)
       (pred_11 obj_14 obj_20)
       (pred_11 obj_01 obj_05)
       (pred_11 obj_01 obj_03)
       (pred_11 obj_01 obj_07)
       (pred_11 obj_03 obj_16)
       (pred_11 obj_03 obj_06)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_03 obj_01)
       (pred_11 obj_06 obj_13)
       (pred_11 obj_06 obj_17)
       (pred_11 obj_06 obj_20)
       (pred_11 obj_06 obj_03)
       (pred_11 obj_17 obj_04)
       (pred_11 obj_17 obj_14)
       (pred_11 obj_17 obj_06)
       (pred_11 obj_05 obj_15)
       (pred_11 obj_05 obj_16)
       (pred_11 obj_05 obj_01)
       (pred_11 obj_16 obj_18)
       (pred_11 obj_16 obj_13)
       (pred_11 obj_16 obj_03)
       (pred_11 obj_16 obj_05)
       (pred_11 obj_13 obj_02)
       (pred_11 obj_13 obj_04)
       (pred_11 obj_13 obj_06)
       (pred_11 obj_13 obj_16)
       (pred_11 obj_04 obj_09)
       (pred_11 obj_04 obj_17)
       (pred_11 obj_04 obj_13)
       (pred_11 obj_15 obj_18)
       (pred_11 obj_15 obj_05)
       (pred_11 obj_18 obj_02)
       (pred_11 obj_18 obj_16)
       (pred_11 obj_18 obj_15)
       (pred_11 obj_02 obj_09)
       (pred_11 obj_02 obj_13)
       (pred_11 obj_02 obj_18)
       (pred_11 obj_09 obj_04)
       (pred_11 obj_09 obj_02)
       (pred_7 obj_03)
       (pred_7 obj_07)
       (pred_5  obj_03 obj_11)
       (pred_5  obj_07 obj_12)
       (pred_2 obj_08)
       (pred_2 obj_20)
       (pred_2 obj_14)
       (pred_2 obj_01)
       (pred_2 obj_06)
       (pred_2 obj_17)
       (pred_2 obj_05)
       (pred_2 obj_16)
       (pred_2 obj_13)
       (pred_2 obj_04)
       (pred_2 obj_15)
       (pred_2 obj_18)
       (pred_2 obj_02)
       (pred_2 obj_09)

       (pred_10  obj_10 obj_11)
       (pred_10  obj_19 obj_12)
       (pred_8 obj_10 obj_08)
       (pred_8 obj_19 obj_05)
       (pred_12 obj_05)
    )

    (:goal (and
       (pred_8 obj_10 obj_09)
    ))
(:constraints
  (always (not (pred_12 obj_13)))
)
)

; plan
1. (op_3 obj_05 obj_19)
   deleted: (pred_8 obj_19 obj_05) (pred_9)
   added: (pred_4 obj_19)
   goals met: 0 of 1
2. (op_5 obj_05 obj_01)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_01)
   goals met: 0 of 1
3. (op_4 obj_01 obj_07 obj_19 obj_12)
   deleted: (pred_7 obj_07)
   added: (pred_2 obj_07)
   goals met: 0 of 1
4. (op_5 obj_01 obj_07)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_07)
   goals met: 0 of 1
5. (op_5 obj_07 obj_08)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_08)
   goals met: 0 of 1
6. (op_2 obj_08 obj_10 obj_19)
   deleted: (pred_4 obj_19) (pred_8 obj_10 obj_08)
   added: (pred_4 obj_10) (pred_8 obj_19 obj_08)
   goals met: 0 of 1
7. (op_5 obj_08 obj_20)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_20)
   goals met: 0 of 1
8. (op_5 obj_20 obj_14)
   deleted: (pred_12 obj_20)
   added: (pred_12 obj_14)
   goals met: 0 of 1
9. (op_5 obj_14 obj_17)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_17)
   goals met: 0 of 1
10. (op_5 obj_17 obj_04)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_04)
   goals met: 0 of 1
11. (op_5 obj_04 obj_09)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_09)
   goals met: 0 of 1
12. (op_1 obj_09 obj_10)
   deleted: (pred_4 obj_10)
   added: (pred_9) (pred_8 obj_10 obj_09)
   goals met: 1 of 1
